backend/views/jadwal/_form.php

    <div class="panel_a panel_a_style">
        <?= $form->field($model, 'id_pelajaran',['labelOptions' => ['class' => 'col-md-4 control-label']])->widget(Select2::classname(),[
                'name' => 'id_pelajaran',
                'data' => ArrayHelper::map($mapel->find()->all(),'id_mapel','nama_mapel'),
---
SELECT * FROM `tbl_mapel`

    ) ?>
    </div>
    <div class="panel_a_style panel_a batas">
        <?= $form->field($model, 'id_kelas',['labelOptions'=>['class' => 'col-md-4 control-label']])->textInput(['maxlength' => true])->widget(Select2::classname(),[
                'data' => ArrayHelper::map($kelas->find()->all(),'id_kelas','nama_kelas'),
                'options' => ['multiple' => false,'placeholder' => 'Pilih Kelas'],
                'pluginOptions' => ['allowClear' => true],
            ]) ?>
---
SELECT * FROM `tbl_kelas`