backend/controllers/JadwalController.php

INSERT INTO `tbl_jadwal` (`id_pelajaran`, `hari`, `jam_masuk`, `jam_keluar`, `id_kelas`) VALUES ('SENI-1', 'Rabu', '09:00:00 AM', '10:30:00 AM', '2IPA1')
---
    public function actionCreate()
    {
        $model = new TblJadwal();
        $kelas = new TblKelas();
        $mapel = new TblMapel();

        if ($model->load(Yii::$app->request->post())) {
            if (strtotime(str_replace(' ','',$model->jam_masuk)) >= strtotime(str_replace(' ','',$model->jam_keluar))){
                 \Yii::$app->getSession()->setFlash('error','Jam Tidak valid');
            }
            else
            {
                if ($model->cekJadwal() != 0){
                    \Yii::$app->getSession()->setFlash('error','Jadwal Tidak Valid');
                }
                else{
                    if ($model->save()){

SELECT `tbl_jadwal`.* FROM `tbl_jadwal` LEFT JOIN `tbl_kelas` ON tbl_kelas.id_kelas = tbl_jadwal.id_kelas GROUP BY `nama_kelas` ORDER BY `jam_masuk`
---
    public function actionSemuaJadwal(){
        $data = TblJadwal::find()->leftJoin('tbl_kelas','tbl_kelas.id_kelas = tbl_jadwal.id_kelas')->groupBy(['nama_kelas'])->orderBy(['jam_masuk'=>'ASC'])->all();

SELECT * FROM `tbl_jadwal` WHERE `id`='55'
---
    protected function findModel($id)
    {
        if (($model = TblJadwal::findOne($id)) !== null) {