frontend/controllers/AkademikController.php

SELECT * FROM `tbl_guru`
---
    public function actionGuru()
    {
      $model = TblGuru::find()->all();

SELECT `tbl_jadwal`.* FROM `tbl_jadwal` LEFT JOIN `tbl_kelas` ON tbl_kelas.id_kelas = tbl_jadwal.id_kelas ORDER BY `jam_masuk`
---
    public function actionJadwal()
    {
      $data = TblJadwal::find()->leftJoin('tbl_kelas','tbl_kelas.id_kelas = tbl_jadwal.id_kelas')->orderBy(['jam_masuk'=>'ASC'])->all();