frontend/controllers/HomeController.php

SELECT * FROM `tbl_ket` WHERE `id`=1
---
    public function actionSejarah()
    {
      $model = TblKet::findOne(1);

SELECT * FROM `tbl_ket` WHERE `id`=1
---
    public function actionVisiDanMisi()
    {
      $model = TblKet::findOne(1);