frontend/controllers/ProgramKerjaController.php

SELECT * FROM `tbl_proker` WHERE `jenis_proker`='Sekolah'
---
  public function actionSekolah(){
    $model = TblProker::find()->where(['jenis_proker'=> 'Sekolah'])->all();

SELECT * FROM `tbl_proker` WHERE `jenis_proker`='Osis'
---
  public function actionOsis()
  {
    $model = TblProker::find()->where(['jenis_proker'=> 'Osis'])->all();

SELECT * FROM `tbl_proker` WHERE `jenis_proker`='PMR'
---
  public function actionPmr(){
    $model = TblProker::find()->where(['jenis_proker'=> 'PMR'])->all();