common/models/FormSearch.php

SELECT `tbl_guru`.* FROM `tbl_guru` LEFT JOIN `tbl_mapel` ON `tbl_guru`.`id_guru` = `tbl_mapel`.`id_guru` LEFT JOIN `tbl_jadwal` ON `tbl_mapel`.`id_mapel` = `tbl_jadwal`.`id_pelajaran` WHERE (`nama_guru`='suriaty, S.Pd') AND (`hari`='selasa')
---
          public function cari()
          {
            return $model = TblGuru::find()->joinWith(['tblMapels' => function($q){
                $q->joinWith(['tblJadwals'=>function($r){
                    $r->where(['hari'=>$this->hari]);
                }]);
            }])->where(['nama_guru'=>$this->nama])->all();