common/models/TblJadwal.php

    public function cekJadwal(){
        return $this->find()->where(['id_pelajaran' => $this->id_pelajaran,'hari'=> $this->hari,'jam_masuk' => $this->jam_masuk,'jam_keluar' => $this->jam_keluar,'id_kelas' => $this->id_kelas])->count();
---
SELECT COUNT(*) FROM `tbl_jadwal` WHERE (`id_pelajaran`='SENI-1') AND (`hari`='Rabu') AND (`jam_masuk`='09:00:00 AM') AND (`jam_keluar`='10:30:00 AM') AND (`id_kelas`='2IPA1')