common/models/TblUser.php

SELECT * FROM `tbl_user` WHERE `id`='12345'
---
    public static function findIdentity($id)
    {
        //mencari user login berdasarkan IDnya dan hanya dicari 1.
        $user = TblUser::findOne($id);